#+TITLE: Clojure Vs Javascript
** Javascript
#+BEGIN_SRC js :results ouput :exports both
    // catetos (menor/mayor) de cada triángulo rectángulo
    let catetos = [[1, 1.5], [2.5, 2], [3, 3], [4, 3]];

    // hipótenusa de cada triángulo rectángulo
    let hipotenusas = [];

    for (let i=0; i < catetos.length; i++){
        hipotenusas.push(
            Math.sqrt(
                Math.pow(catetos[i][0], 2) + Math.pow(catetos[i][0], 2)
            )
        );
    }

  console.log(hipotenusas);
#+END_SRC

#+RESULTS:
: [1.4142135623730951 (\, 3.5355339059327378) (\, 4.242640687119285) (\, 5.656854249492381)]
*** Ejemplo a comparar
    #+BEGIN_SRC js :results output
      const articulosDeInvierno = [{codigo: 101, prenda: "remera"},
                                   {codigo: 103, prenda: "pantalon"},
                                   {codigo: 109, prenda: "remera"},
                                   {codigo: 121, prenda: "pantalon"},
                                   {codigo: 191, prenda: "remera"}];

      const removerArticuloPor = (predicado) => {
          return listado =>
          listado.reduce((resultado, articulo) => {
              if(predicado(articulo)) return resultado;
              return resultado.concat(articulo);
          }, []);
      };

      const removerRemeras = removerArticuloPor(
          articulo => articulo.prenda == "remera"
      );

      console.log(removerRemeras(articulosDeInvierno));
    #+END_SRC

    #+RESULTS:
    : [ { codigo: 103, prenda: 'pantalon' },
    :   { codigo: 121, prenda: 'pantalon' } ]
*** Ejemplos Básicos
    #+BEGIN_SRC js :results output :exports both
      const preciosDeArticulosComprados = [10, 50, 50, 300];

      const valorInicial = 0; // se conoce por semilla
      const precioTotal = (listaDePrecios) => {
          return listaDePrecios.reduce((resultado, precioDeArticulo) => {
              return resultado + precioDeArticulo
          }, valorInicial);
      };

      console.log(precioTotal(preciosDeArticulosComprados));
    #+END_SRC

    #+RESULTS:
    : 410

